In [5]:
import pandas as pd
import datetime as dt

In [2]:
df = pd.read_csv('../ml-latest-small/ratings.csv')
df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

## TESTING STUFF

In [36]:
past_stamp = 964982703

In [37]:
past = dt.datetime.fromtimestamp(past_stamp)
past

datetime.datetime(2000, 7, 30, 14, 45, 3)

In [38]:
now = dt.datetime.utcnow()
now

datetime.datetime(2023, 5, 18, 17, 6, 3, 919287)

In [39]:
now_stamp = dt.datetime.timestamp(now)

In [40]:
now - past

datetime.timedelta(days=8327, seconds=8460, microseconds=919287)

In [41]:
12*(now.year - past.year) + (now.month - past.month)

274

In [45]:
(now_stamp-past_stamp)/(60*60*24*30.4166666)

273.7676036895694

## AAA

In [47]:
df['timestamp'] = pd.to_datetime(df['timestamp'], unit='s')
df.head()

   userId  movieId  rating           timestamp
0       1        1     4.0 2000-07-30 18:45:03
1       1        3     4.0 2000-07-30 18:20:47
2       1        6     4.0 2000-07-30 18:37:04
3       1       47     5.0 2000-07-30 19:03:35
4       1       50     5.0 2000-07-30 18:48:51

In [52]:
users = df.groupby('userId').agg({'timestamp':['min', 'max'], 'rating':'count'})
users.head()

                 timestamp                     rating
                       min                 max  count
userId
1      2000-07-30 18:08:19 2000-08-08 07:27:42    232
2      2015-10-24 19:27:15 2015-10-24 19:35:40     29
3      2011-05-27 02:28:43 2011-05-27 02:44:53     39
4      1999-12-13 09:47:08 2001-12-05 17:49:02    216
5      1996-11-08 06:32:27 1996-11-08 06:42:17     44

In [59]:
users['diff'] = users['timestamp']['max'] - users['timestamp']['min']
users.head()

                 timestamp                     rating              diff
                       min                 max  count
userId
1      2000-07-30 18:08:19 2000-08-08 07:27:42    232   8 days 13:19:23
2      2015-10-24 19:27:15 2015-10-24 19:35:40     29   0 days 00:08:25
3      2011-05-27 02:28:43 2011-05-27 02:44:53     39   0 days 00:16:10
4      1999-12-13 09:47:08 2001-12-05 17:49:02    216 723 days 08:01:54
5      1996-11-08 06:32:27 1996-11-08 06:42:17     44   0 days 00:09:50

In [60]:
users.describe()

            rating                         diff
             count
count   610.000000                          610
mean    165.304918  234 days 07:04:58.585245900
std     269.480584  748 days 22:18:20.006164080
min      20.000000              0 days 00:00:38
25%      35.000000       0 days 00:14:43.250000
50%      70.500000       0 days 01:18:08.500000
75%     168.000000             38 days 19:15:06
max    2698.000000           6557 days 04:44:16

In [66]:
users[users['diff'] == users['diff'].max()]

                 timestamp                     rating               diff
                       min                 max  count
userId
414    2000-06-19 17:36:56 2018-06-02 22:21:12   2698 6557 days 04:44:16